Revit 2026 API

# ElementTypeDuplicatedEventArgs Class

---

The event arguments used by the ElementTypeDuplicated event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs Autodesk.Revit.DB.EventsElementTypeDuplicatedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementTypeDuplicatedEventArgs : RevitAPIPostDocEventArgs
```
```vb
Public Class ElementTypeDuplicatedEventArgs
	Inherits RevitAPIPostDocEventArgs
```
```cpp
public ref class ElementTypeDuplicatedEventArgs : public RevitAPIPostDocEventArgs
```
```fsharp
type ElementTypeDuplicatedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
```

The ElementTypeDuplicatedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | NewElementTypeId | The id of the newly duplicated ElementType. |
|  | NewName | The name of the newly duplicated ElementType. |
|  | OriginalElementTypeId | The id of the element type that is duplicated. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace